[
    {
        "icPesquisa": true,
        "titleResearch": "Didactic conceptions and practices of teacher education",
        "resume": "The research investigated what prevails as Didactics in teacher education courses, through the perspective of the educator. It was aimed at Didactics professors of licentiate courses from three Universities in the State of Rio de Janeiro, seeking to know about who are the educators, what they teach and how they teach Didactics knowledges, based on the goals of analizing conceptions and practices which substantiate Didactics in licentiate courses and recognizing the meanings attributed by the educator onto their teaching of the professional knowledge of the teacher during education. The study was based on the ideas of Gauthier (1998), Roldão (2007), Cochran-Smith; Lytle (1999), André et al (2010) e Zeichner (2009) to discuss education and the challenges that mark the learning in teaching during the portion of education occurring in college. From the analysis of testimonies gathered in discussion groups composed of up to ten professors from each university, it discussed the didactic conception of the educators, sticking to the comprehension they exhibit of the Didactics field and the didactic practice they developed while teaching this subject.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2009-2012",
        "financing": "FAPERJ (Settlement) – CNPq (PDJ)",
        "researchLink":  "CRUZ, G. B. da; ANDRÉ, M. E. D. A. Teaching Didactics: An inquiry on conceptions and practices of educating professors. Education in Magazine (UFMG, Printed), v. 30, p. 181-203, 2014. Available at: https://www.scielo.br/j/edur/a/bZv5ftwDQFhCXJtX3FfGXFB/abstract/?lang=pt <br/><br/>CRUZ, G. B. da; ANDRÉ, M. E. D. A. Teaching Didactics and the teaching learning through the eyes of educating professors. Educational Dialogue Magazine (PUCPR. Printed), v. 12, p. 77-99, 2012 Available at: http://educa.fcc.org.br/pdf/de/v12n35/v12bn35a05.pdf"
    },
    {
        "icPesquisa": true,
        "titleResearch": "The role of licentiate practices in building the professional identity of future teachers",
        "resume": "The research sought to investigate conceptions from licentiate students about the teaching profession and the role of licentiate practices in building the professional identity of future teachers. It was conducted with the goals of: knowing the expectations,  beliefs, values and conceptions of the licentiate students about the teaching profession; identifying knowledges and practices of the course considered most significative to the students, future teachers; analizing the contribution of the classes and curricular practices of the licentiate course to the professional development of the students. Theoretically, it was fundamented on Roldão (2005; 2007); Shulman (1986; 2004); Sacristán (1995); Ramalho, Nuñez and Gauthier (2004). The subjects of the research were students undergoing the last periods of the licentiate course in the years 2010 and 2011, in seven institutions (two public, four community, one private), located in states from the South, Southeast and Northeast of the country. The licentiate courses studied were Pedagogy, Languages, History, Mathematics and Biology. The main source of data was the discussion group, through the perspective of Flick (2004) and Weller (2010).",
        "coordination": "Marli André (PUC/SP)",
        "period": "2010-2012",
        "financing": "CNPq (Universal 2010)",
        "researchLink":  "ANDRÉ, M. E. D. A. ; ALMEIDA, P. A. ; AMBROSETTI, N. B. ; PASSOS, L. F. ; CRUZ, G. B. da ; HOBOLD, M. The Role of the Educator Professor and the Licentiate practices through the evaluative look of future teachers. Portuguese Educational Investigation Magazine, v. 12, p. 99-121, 2012. Available at: https://revistas.ucp.pt/index.php/investigacaoeducacional/article/view/3377"
    },
    {
        "icPesquisa": true,
        "titleResearch": "Didactics and the learning in teaching in the process of professional constitution of future teachers",
        "resume": "The investigative object resided in the problem surrounding what prevails as Didactics in the courses of teacher education and its effects to the professional constitution process of future teachers. For such, the research sought to analize knowledges on teaching built on the study of Didactics by future teachers, graduating from licentiate courses, as well as the consequences of the Didactics subject to the process of constituting the professional teaching knowledges, more closely to what the educator professor, in Didactics, do to teach education. The study was based on the ideas of Roldão (2007; 2005), Shulman (1986; 1987; 2004), Gauthier (1998) and Cochran-Smith; Lytle (1999), to discuss teaching and the challenges which mark the learning in teaching. To gather date for the proposed analyses, we resorted to applying surveys among Didactics students from 14 licentiate courses of one of the investigated Universities from the previous inquiry, and to the realization of four discussion groups.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2012-2015",
        "financing": "FAPERJ (Apq1)",
        "researchLink":  "CRUZ, G. B. da. Didactics teaching and the learning of teaching in the initial education of teachers. Research Journals (FUNDAÇÃO CARLOS CHAGAS. PRINTED), v. 47, p. 1166- 1195, 2017 Available at: https://www.scielo.br/j/cp/a/gCsmRvTMHmX6rppc4tg3CKK/abstract/?lang=pt <br/><br/>CRUZ, G. B. da; CAMPELO, T. da S. The educator professor and the Didactics teaching in the Geography course: the student perspective. Educational Dialogue Magazine (PUCPR. Printed), v. 16, p. 851-870, 2016. Available at: https://www.redalyc.org/pdf/1891/189148893004.pdf                 <br/><br/>CRUZ, G. B. da; RODRIGUES, P. A. M. Didactics teaching and the work of the educator professor through the view of licentiate students on artistic education. Education and Research (USP. Printed), p. 483-498, 2017. Available at: https://www.revistas.usp.br/ep/article/view/136766 <br/><br/>CRUZ, G. B. da; BATALHA, C. S. Didactics and teaching in the context of the Dance licentiate degree. Unisinos Education, v. 22, p. 288-297, 2018. Available at: http://revistas.unisinos.br/index.php/educacao/article/view/edu.2018.224.06 <br/><br/>CRUZ, G. B. da; CASTRO, P. H. Z. C. Didactics and the education of the Physical Education teacher: an analysis through the evaluation of graduating students. Pro-positions (UNICAMP. ONLINE), v. 30, p. 01-25, 2019. Available at: https://www.scielo.br/j/pp/a/kJrVmZBcG7XtSWpB4hxqHps/abstract/?lang=pt <br/><br/>CRUZ, G. B. da; BATALHA, C. S.; MARCEL, J.; CASTRO, P. H. Z. C. Didactis in the initial education of teachers: conceptions and practices of educator professors through the view of students. International Magazine of teacher education, v. 3, p. 3-17, 2018. Available at: https://periodicos.itp.ifsp.edu.br/index.php/RIFP/article/view/694"
    },
    {
        "icPesquisa": true,
        "titleResearch": "Didactic conceptions and practices of egress students from Licentiate courses",
        "resume": "The research investigated how beginner teachers, just after graduating on licentiate courses, evaluate their Didactics education. Which didactic conceptions and practices define the teaching they perform? The participants group was composed of 16 egress students from 14 licentiate courses. We found one egress student from each course who completed their initial education in up to three years (2013-2015) and who was admitted to a public network of municipal, state or federal education,  located in the State of Rio de Janeiro, also in the period of up to three years (2013-2015). The setup of the subject group was justified by the research goals consisting in: analizing the contribution of the Didactics education for the performance of teachers in the beginning of the career; mapping and categorizing didactic conceptions and practices which guide the education of these teachers. Theoretically, the study was based on three key ideas: i- the teaching, subject of Didactics, while professional specificity of education (ROLDÃO, 2007; 2005); ii- Didactics and the basis of professional knowledge of teaching (SHULMAN, 1987); iii- learning perspectives on teaching (COCHRAN-SMITH, 2012; 2003; 1999; 1991). Methodologically, we performed interviews with all the subjects and observed a set of ten classes from part of the participants. We sought with the realization of this study to contribute to the knowledge of what prevails as Didactics on the basis of the professional teaching knowledge accessed in the first years of teaching practice, in order to provide elements both for revising the curriculum of licentiate courses, and to programs of continuing education of teachers.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2015-2018",
        "financing": "No sponsoring.",
        "researchLink":  "CRUZ, G. B. da. Didactics and teaching through the view of beginner teachers. Cocar Magazine (UEPA), v. 8, p. 45-66, 2020. Available at: https://periodicos.uepa.br/index.php/cocar/article/view/3046 <br/><br/>CRUZ, G. B. da. Beginner teachers and their view on education: didactic-pedagogical aspects. Teaching (GRANADA), v. 23, p. 93-112, 2019. Available at: https://digibug.ugr.es/handle/10481/60556 <br/><br/>CRUZ, G. B. da; BATALHA, C. S.; COSTA, E. C. S.; OLIVEIRA, F. L.; FERNANDES, I. C. B.; CASTRO, P. H. Z. C. Didactic practices in the professional teacher insertion. School portraits, v. 16, p. 149-169, 2022. Available at: https://retratosdaescola.emnuvens.com.br/rde/article/view/1290 <br/><br/>CRUZ, G. B. da; LAHTERMAHER, F. Perspectives of teacher induction: possibilities facing the tensions and challenges of teachers in professional insertion. In: MARCELO GARCÍA, C.; MARTINÉZ, P. Start with the right foot: experiences of induction and guidance programs to beginner teachers. Barcelona/ES: Octaedro, 2022, p. 75-96. Available at: https://octaedro.com/libro/empezar-con-buen-pie/ <br/><br/>CRUZ, G. B. da; BATALHA, C. S.; LAHTERMAHER, F.; CAMPELO, T. da S. Didactics and teaching during uncertain times: challenges of a democratic education and social justice. Perspective, Florianopolis, v. 40, n. 3, p. 01-21, jul/sep, 2022. Available at: https://periodicos.ufsc.br/index.php/perspectiva/issue/view/3337"
    },
    {
        "icPesquisa": true,
        "titleResearch": "Professional insertion of students egress from Programs of Teaching Initiation",
        "resume": "Research coordinated by professor Marli André, in the scope of the Nucleus of Studies and Research on Professional Teaching Development, of PUC/SP, with support from the Universal Notice 2015 CNPq. It was conducted to investigate how egress students from programs of teaching initiation are experiencing their professional insertion to teaching. The programs whence they come are: PIBID (Institutional Program of Teaching Initiation Scholarship), of federal scope, the Alphabetizing Scholarship, from the state govern of Sao Paulo and the Program of Pedagogical Residency of the Federal University of Sao Paulo, in partnership with the city secretary of Guarulhos, SP. We sought to contribute to the knowledge of the facilitating and hindering elements of the first years of teaching practice, in order to provide elements both for revising the curriculum of the initial education courses, and to the administrators of the schools committed to a proper environment for the teaching and learning of students, as for admnistrators of public policies. In the methodological approach we opted to conduct a survey, to map the professional situation of the egress students, and case studies to get deeper aspects of professional insertion. The data gathering was conducted in two stages: a) electronic query on the professional situation of egress students; b) case studies of schools which received the egress students, resorting to observations, interviews with the egress students and administrators and gathering of school documents. In the theoretical field, we sought to contribute to amplify the comprehension of socialization and professional development processes of beginners.",
        "coordination": "Marli André (PUC/SP)",
        "period": "2016-2018",
        "financing": "CNPq (Universal 2015)",        
        "researchLink":  "OLIVEIRA, F. L.; CRUZ, G. B. da. Professional insertion of an egress student from PIBID: The case of a Math teacher. Education Portuguese Magazine, v. 32, p. 5-23, 2019. Available at: https://revistas.rcaap.pt/rpe/article/view/18006 <br/><br/>OLIVEIRA, F. L.; CRUZ, G. B. da. The teaching insertion of a Math teacher egress from PIBID. Contemporary Education Magazine, v. 13, p. 222-240, 2018. https://revistas.ufrj.br/index.php/rce/article/view/14060/pdf"
    },
    {
        "icPesquisa": true,
        "titleResearch": "Inquiry with beginner teachers: a study on professional induction",
        "resume": "The study was conducted to investigate how the induction among peers mediate by the research contributed to the acting and reacting of teachers in relation to the hardships that affected teaching in the first years of professional practice. Inserted in the field of the narrative as an (auto)biographic activity, it was conducted through the perspective of the research-education as a strategy of professional induction of teachers in the context of public networks of education located in the States of Rio de Janeiro, Santa Catarina and Ceara, involving three big moments: preparing stage, research-education as induction stage; and analysis of the narratives and the efficiency and contribution of the developed induction process stage. Theoretically it was based on the ideas of: i) Marcelo and Vaillant (2017), regarding professional induction; ii) Clandinin and Connelly (2015); Delory-Momberger (2016); and Josso (2006), referring to the narrative research; iii) Cochran-Smith (2012); Zeichner, Payne and Brayco (2015); and Nóvoa (2017, 1995), regarding teacher education. We sought to, with the research results, promote the development of a process of professional induction based on investigating and collective work, which assumes the highlighting of fundaments and systematization of materials, strategies and practices which constitute an educating device with marks distinct from those already built and prevailing in the scope of the current public policies.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2019-2022",
        "financing": "FAPERJ (CNE) and CNPq (Universal Notice 2018)",
        "researchLink":  "CRUZ, G. B. da; FARIAS, I. M. S. de; HOBOLD, M. de S. Professional induction and the beginning of the teaching work: debates and needs. Education Electronic Magazine (SAO CARLOS), v. 14, p. 4149114-15, 2020. Available at: http://www.reveduc.ufscar.br/index.php/reveduc/article/view/4149 <br/><br/>CRUZ, G. B. da; PAIVA, M. M. S. ; TEIXEIRA, V. L. (Auto)biographic narrative as a research-education dvice in professional teacher induction. (Auto)Biographic Research Brazilian Magazine, v. 6, p. 956-972, 2021. Available at: https://www.revistas.uneb.br/index.php/rbpab/article/view/12666 <br/><br/>CRUZ, G. B. da; COSTA, E. C. dos S.; PAIVA, M. M. de S.; ABREU, T. B. de. Teacher induction under review: competing meanings and prevailing practices Research Journals, v. 55, e09072, 2022. Available at: https://publicacoes.fcc.org.br/cp/article/view/9072"
    },
    {
        "icPesquisa": true,
        "titleResearch": "Induction processes of Beginner Teachers in Basic School",
        "resume": "It is an Inter-Institutional Program of research focused on the induction processes of beginner teachers in Basic Education. The specific goals were: to create conditions and an environment proper to the development of collaborative investigating processes; to articulate knowledges produced in various contexts on induction processes of beginner teachers; to promote the design and implementation of formative processes focused on beginner teachers and educators of public schools and secretaries of education; to promote the creation of partnerships among universities, public schools and Municipal Secretaries of Education for proposing induction programs; to develop the education of researchers focused on the themes of induction processes and to highlight evidences for the constitution of Induction Programs and Policies. The project, with an inter-institutional character, was composed of 10 sub-projects, developed by researchers from 13 Institutions of Higher Education, in various contexts (different cities from different states of the country), through the perspective of a collaborative research. The basic methodology was a collaborative one, where the participants engage on a process of producing knowledges and at the same time educating themselves. The sub-projects share common aspects of the research methodology.",
        "coordination": "Marli André and Laurizete Ferragut Passos (PUC/SP)",
        "period": "2019-2022",
        "financing": "CNPq (Universal Notice 2018)",
        "researchLink":  "ANDRÉ, M. E. D. A.; PASSOS, L. F.; ALMEIDA, P. A. Education Dossier and professional insertion of beginner teachers: concepts and practices. Education Electronic Magazine – REVEDUC (UFSCAR), 2020. Available at: http://www.reveduc.ufscar.br/index.php/reveduc/article/view/4780 <br/><br/>CRUZ, G. B. da; FARIAS, I. M. S. de; HOBOLD, M. de S. Professional induction and the beginning of teaching work: debates and needs). Education Electronic Magazine (SAO CARLOS), v. 14, p. 4149114-15, 2020. Available at: http://www.reveduc.ufscar.br/index.php/reveduc/article/view/4149"
    },
    {
        "icPesquisa": false,
        "titleResearch": "University, School and education in professional teacher induction: perspectives of induction",
        "resume": "Program of inter-institutional research, articulated by the Laboratory of Studies and Research on Didactics and Teacher Education (LEPED/UFRJ), with the goal of investigating possibilities and challenges of induction among peers mediated by the actions of the School, the University and which occurs from the partnership between University-School for the acting and reacting of teachers in relation to the difficulties that affect teaching in the first years of professional practice. The research focus on different initiatives of aiding and guiding beginner teachers during their professional insertion with vestiges of specific education. Theoretically it is based on the ideas of Marcelo and Vaillant (2017), in regards to professional teacher induction; and Cochran-Smith (2012); Zeichner, Payne and Brayco (2015); regarding the teacher education. Methodologically, it is conducted in the form of multiply case studies, focused on the induction as teacher education during the professional insertion. It seeks to develop three case studies: i) Collective case study focused on School, involving the city education networks of Rio de Janeiro/RJ, Niteroi/RJ and Belo Horizonte/MG; ii) Case study focused on University, involving  induction groups in UFRJ, UFSC and UECE; iii) Single case study focused on the partnership between University-School, in the context of the Complex of Teacher Education of UFRJ. It seeks, with its results, to promote the development of a professional induction process  based on the collaborative work and partnership among university-school, which assumes the highlighting of fundaments and the systematization of materials, constitutive strategies and practices of an education device with distinct marks from those already established and prevailing in the scope of current public policies.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2019-2023",
        "financing": "FAPERJ (Emerging Research Groups in the State of Rio de Janeiro)",
        "researchLink": ""
    },
    {
        "icPesquisa": false,
        "titleResearch": "Teacher induction conceptions, policies and practices in Latin America: which perspective for which education?",
        "resume": "This project seeks to scrutinize which education conception and professional teaching development guide instituded policies of induction and the local and regional experiences in its favor in the latin-american context. It seeks to analize meanings of teacher induction and perspectives of its implementation, be it through educational public policies, institutional programs or specific actions towards it; to systematize an array of data on the diversity of education proposals regarding teaching in the first years of professional practice; and to develop strategies of teacher induction for social justice and committed to opposing educational inequalities. Methodologically it is constituted as a theoretical-empiric study, of a qualitative nature, centered in the revision of a systematic literature, based on Newman; Gouch (2020), aiming at the synthesis of study evidences.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2022-2023",
        "financing": "CAPES PrInt",
        "researchLink": ""
    },
    {
        "icPesquisa": false,
        "titleResearch": "Curricular challenges to the teacher education: insurging demands and contemporary institutional experiences",
        "resume": "This project, resulting from the articulation of different consolidated investigative teams, is inscribed in contemporary political-educational debates on the production of curricular policies focused on the education of the basic education teacher. The study is focused on the multi-dimensionality of the challenges that permeate these policies, highlighting six dimensions which constitute the axes of problematizing around which the expected actions of the inquiry are organized: (a) the role of digital culture in education; (b) the demands of the social movements and the consideration of difference; (c) the role of school in education for citizenship, health and quality of life, and environmental justice; (d) the relation with multiple knowledges that participate on the teacher education; (e) the processes of teacher subjectivation; (f) the development of collaborative methodologies in contexts of initial and continuing education. It deals with the hyphothesis that facing these different challenges demands the reconfiguration of institution arrangements between university, public schools and communities where they prioritize horizontality, plurality and integration between subjects, knowledges and formative experiences. The formulation of this initial hypothesis is based on the ensemble of scientific production that highlights the fatigue of formative models historically hegemonized, as well as on the emergence of institutional experiences intent on offering possible paths to overcome dycothomies, hierarchizations and fragmentations that present themselves as tensions and obstacles to the professional teacher education facing the demands which permeate public schools and universities in our present. From formative scenarios selected in the scope of ‘new’ institutional experiences, the empiric analysis seeks to contribute to the advance of the research  over other possibilities of conceiving and inhabiting academic and scholar curricula in the formative process of the professional teacher.",
        "coordination": "Carmen Teresa Gabriel (UFRJ)",
        "period": "2022-2024",
        "financing": "CNPq (Universal Notice 2021)",
        "researchLink": ""
    },
    {
        "icPesquisa": false,
        "titleResearch": "Beginner teacher education and its process of teacher subjectivation in contexts of social vulnerability: perspectives of induction for social justice",
        "resume": "The inquiry, anchored on a larger research, conducted by Gabriel (2021) – Curricular challenges of teacher education: insurgent demands and contemporary institutional experiences – seeks to analize constitutive experiences of a process of guidance of teachers in professional insertion in public schools from the Municipal Education Network of Rio de Janeiro located in socially vulnerable areas, in the sense of answering the following question: How is it to be and to become a teacher through uncertainties of the beginning of the profession and the contexts of educational inequality and social vulnerability which surround the school community? Committed to the challenges of a democratic education, focused on social justice, and inscribed in the field of the narrative as an (auto)biographic activity, it will be conducted through the perspective of research-education as a strategy of professional induction. The strategies of research-education aiming at the production of empiric material for investigative analysis will involve: auto-biographic narratives (Delory-Moberger, 2016), conversation circles, teaching cases (Mizukami, 2000) and reflexive journal (Zabalza, 2004). Theoretically it will consider 5 argumentative fronts: i- teacher induction, with Ávalos (2012; 2016); Cruz et ali (2020; 2022) and Lahtermaher (2021); ii) Teacher subjectivation, with Guattari and Rolnik (1996); iii) Teacher education for social justice with Cochran-Smith (2012); Zeichner et ali (2015) and Candau (2011; 2016; 2020); iv) Territory and social vulnerability, with Burgos (2005; 2008a; 2008b; 2014); Narrative research interfacing with research-education, with Clandinin and Connelly (2015), Delory-Momberger (2016) and Josso (2006). The participants are teachers from any stage of basic education, beginning their careers, with up to 5 years of professional practice as titular teachers in a municipal public school, located preferably in a socially vulnerable area of the city of Rio de Janeiro, selected through public notice, based on specific criteria.",
        "coordination": "Giseli Barreto da Cruz (UFRJ)",
        "period": "2022-2024",
        "financing": "FAPERJ – CNPq",
        "researchLink": ""
    }
]